Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 40, 40, 1)    0
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 40, 40, 32)   320         input_1[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 40, 40, 32)   9248        conv2d[0][0]
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 20, 20, 32)   0           conv2d_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 20, 20, 64)   18496       max_pooling2d[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 20, 20, 64)   36928       conv2d_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 10, 10, 64)   0           conv2d_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 10, 10, 64)   36928       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 10, 10, 64)   36928       conv2d_4[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 5, 5, 64)     0           conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 5, 5, 128)    73856       max_pooling2d_2[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 5, 5, 128)    147584      conv2d_6[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 5, 5, 1)      1153        conv2d_7[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 25)           0           conv2d_8[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 12)           312         flatten[0][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, 12)           0           dense[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 12)           156         dropout[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 12)           0           dense_1[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 25)           325         dropout_1[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 25)           0           dense_2[0][0]
__________________________________________________________________________________________________
reshape (Reshape)               (None, 5, 5, 1)      0           dropout_2[0][0]
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 5, 5, 128)    1280        reshape[0][0]
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 5, 5, 256)    295168      conv2d_transpose[0][0]
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 10, 10, 256)  0           conv2d_transpose_1[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 10, 10, 320)  0           up_sampling2d[0][0]
                                                                 conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 10, 10, 64)   184384      concatenate[0][0]
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 10, 10, 64)   36928       conv2d_transpose_2[0][0]
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 20, 20, 64)   0           conv2d_transpose_3[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 20, 20, 128)  0           up_sampling2d_1[0][0]
                                                                 conv2d_3[0][0]
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 20, 20, 64)   73792       concatenate_1[0][0]
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 20, 20, 64)   36928       conv2d_transpose_4[0][0]
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 40, 40, 64)   0           conv2d_transpose_5[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 40, 40, 96)   0           up_sampling2d_2[0][0]
                                                                 conv2d_1[0][0]
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 40, 40, 32)   27680       concatenate_2[0][0]
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 40, 40, 32)   9248        conv2d_transpose_6[0][0]
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 40, 40, 1)    289         conv2d_transpose_7[0][0]
==================================================================================================
Total params: 1,027,931
Trainable params: 1,027,931
Non-trainable params: 0